Contain the R code (folder) code used to generate the results for the
cortisol AUC article.
- =analysis-AUC-cortisol.R=: simulation study
- =data-management.R=: data management for the real studies (export processed data in the folder data)
- =re-analysis.R=: re-analysis of the real studies using 3 vs. 5 measurements to compute the CAR-AUCi 

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
library(readxl)
library(data.table)
library(ggplot2)
library(ggpubr)
library(pracma)
library(mgcv)
library(lcmm) ## install.packages("lcmm")
library(xtable)
library(kmlShape) ## install.packages("kmlShape")
library(plyr)
library(lubridate)
library(xlsx)
library(nlme)
library(xtable)
library(officer)
#+END_SRC

R and package versions:
  #+BEGIN_SRC R :exports both :results output :session *R* :cache no
sessionInfo()
  #+END_SRC

  #+RESULTS:
  #+begin_example
  R version 4.1.1 (2021-08-10)
  Platform: x86_64-w64-mingw32/x64 (64-bit)
  Running under: Windows 10 x64 (build 19044)

  Matrix products: default

  locale:
  [1] LC_COLLATE=Danish_Denmark.1252  LC_CTYPE=Danish_Denmark.1252   
  [3] LC_MONETARY=Danish_Denmark.1252 LC_NUMERIC=C                   
  [5] LC_TIME=Danish_Denmark.1252    

  attached base packages:
  [1] parallel  stats     graphics  grDevices utils     datasets  methods  
  [8] base     

  other attached packages:
   [1] officer_0.4.1          xlsx_0.6.5             lubridate_1.8.0       
   [4] plyr_1.8.6             kmlShape_0.9.5         lattice_0.20-45       
   [7] kml_2.4.1              longitudinalData_2.4.1 misc3d_0.9-1          
  [10] rgl_0.108.3            clv_0.3-2.2            cluster_2.1.2         
  [13] class_7.3-19           xtable_1.8-4           lcmm_1.9.4            
  [16] randtoolbox_1.31.1     rngWELL_0.10-7         mvtnorm_1.1-3         
  [19] survival_3.2-13        mgcv_1.8-38            nlme_3.1-153          
  [22] pracma_2.3.6           ggpubr_0.4.0           ggplot2_3.3.5         
  [25] data.table_1.14.2      readxl_1.3.1          

  loaded via a namespace (and not attached):
   [1] Rcpp_1.0.8        tidyr_1.1.4       xlsxjars_0.6.1    assertthat_0.2.1 
   [5] digest_0.6.29     utf8_1.2.2        R6_2.5.1          cellranger_1.1.0 
   [9] backports_1.4.1   pillar_1.7.0      rlang_1.0.1       uuid_1.0-3       
  [13] car_3.0-12        extrafontdb_1.0   Matrix_1.4-0      splines_4.1.1    
  [17] extrafont_0.17    htmlwidgets_1.5.4 munsell_0.5.0     broom_0.7.11     
  [21] compiler_4.1.1    xfun_0.29         pkgconfig_2.0.3   htmltools_0.5.2  
  [25] tcltk_4.1.1       tidyselect_1.1.1  tibble_3.1.6      fansi_1.0.2      
  [29] crayon_1.5.0      dplyr_1.0.7       withr_2.4.3       grid_4.1.1       
  [33] jsonlite_1.7.2    Rttf2pt1_1.3.10   gtable_0.3.0      lifecycle_1.0.1  
  [37] DBI_1.1.2         magrittr_2.0.2    scales_1.1.1      zip_2.2.0        
  [41] cli_3.2.0         carData_3.0-5     ggsignif_0.6.3    xml2_1.3.3       
  [45] ellipsis_0.3.2    generics_0.1.1    vctrs_0.3.8       tools_4.1.1      
  [49] glue_1.6.1        purrr_0.3.4       abind_1.4-5       fastmap_1.1.0    
  [53] colorspace_2.0-3  rstatix_0.7.0     rJava_1.0-6       knitr_1.37
  #+end_example
